backend/Catalogs/ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ОбъектыНедвижимости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЖилья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЖилья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаНочь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КоличествоКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КоличествоМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗаезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВремяЗаезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВремяВыезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКАватарке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыУдобств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУдобств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/CommonModules/СервисОбъектыНедвижимости/Ext/Module.bsl
Функция ПолучитьСписокСервисов() Экспорт
	
	Результат = Новый Массив;
	СписокСервисов = Справочники.ОбъектыНедвижимости.ПолучитьСписок();
	
	Для Каждого Сервис Из СписокСервисов Цикл
		Результат.Добавить(Конверторы.СервисВСтруктуру(Сервис));		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНовыйСервис(СтруктураДанных) Экспорт	
	Результат = Справочники.ОбъектыНедвижимости.ПустаяСсылка();
	
	НовыйЭлемент = Справочники.ОбъектыНедвижимости.СоздатьЭлемент();
	НовыйЭлемент.Наименование = СтруктураДанных.offer.title;
	НовыйЭлемент.Адрес = СтруктураДанных.offer.address;
	НовыйЭлемент.ВидЖилья = Конверторы.СтрокаВВидЖилья(СтруктураДанных.offer.type);
	НовыйЭлемент.ЦенаЗаНочь = СтруктураДанных.offer.price;
	НовыйЭлемент.КоличествоКомнат = Конверторы.СтрокаВКоличествоКомнат(СтруктураДанных.offer.rooms);
	НовыйЭлемент.КоличествоМест = Конверторы.СтрокаВКоличествоМест(СтруктураДанных.offer.guests);
	НовыйЭлемент.ВремяЗаезда = Конверторы.СтрокаВВремяЗаезда(СтруктураДанных.offer.checkin);
	НовыйЭлемент.ВремяВыезда = Конверторы.СтрокаВВремяВыезда(СтруктураДанных.offer.checkout);
	НовыйЭлемент.Описание = СтруктураДанных.offer.description;
	НовыйЭлемент.КоординатаХ = СтруктураДанных.location.x;
	НовыйЭлемент.КоординатаУ = СтруктураДанных.location.y;
	
	Для Каждого Опция Из СтруктураДанных.offer.features Цикл
		НоваяОпция = НовыйЭлемент.ВидыУдобств.Добавить();
		НоваяОпция.Опция = Конверторы.СтрокаВВидУдобства(Опция);
	КонецЦикла;
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции
